-- phpMyAdmin SQL Dump
-- version 4.5.4.1deb2ubuntu2
-- http://www.phpmyadmin.net
--
-- Хост: localhost
-- Время создания: Апр 09 2017 г., 12:35
-- Версия сервера: 5.7.17-0ubuntu0.16.04.1
-- Версия PHP: 7.0.15-0ubuntu0.16.04.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `achievement`
--

-- --------------------------------------------------------

--
-- Структура таблицы `employees`
--

CREATE TABLE `employees` (
  `id_employee` int(11) NOT NULL COMMENT 'Идентификатор',
  `id_department` int(11) DEFAULT NULL COMMENT 'Идентификатор отдела',
  `f1` varchar(30) NOT NULL COMMENT 'Фамилия',
  `f2` varchar(30) NOT NULL COMMENT 'Имя',
  `f3` varchar(30) NOT NULL COMMENT 'Отчество',
  `birthday` date NOT NULL COMMENT 'Дата рождения',
  `id_position` int(11) NOT NULL COMMENT 'Идентификатор должности',
  `hourly_payment` tinyint(1) DEFAULT NULL COMMENT 'почасовая оплата',
  `salary` float NOT NULL COMMENT 'оклад или ставка'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `employees`
--

INSERT INTO `employees` (`id_employee`, `id_department`, `f1`, `f2`, `f3`, `birthday`, `id_position`, `hourly_payment`, `salary`) VALUES
(1832, 75, 'Фамилия-1', 'Имя-1', 'Отчество-1', '1998-01-11', 61, 0, 1500),
(1833, 75, 'Фамилия-2', 'Имя-2', 'Отчество-2', '1998-01-11', 62, 0, 1200),
(1834, 75, 'Фамилия-3', 'Имя-3', 'Отчество-3', '1998-01-11', 63, 1, 25),
(1835, 75, 'Фамилия-4', 'Имя-4', 'Отчество-4', '1998-01-11', 63, 1, 25),
(1836, 75, 'Фамилия-5', 'Имя-5', 'Отчество-5', '1998-01-11', 63, 1, 25),
(1837, 75, 'Фамилия-6', 'Имя-6', 'Отчество-6', '1998-01-11', 63, 1, 25),
(1838, 75, 'Фамилия-7', 'Имя-7', 'Отчество-7', '1998-01-11', 63, 1, 25),
(1839, 75, 'Фамилия-8', 'Имя-8', 'Отчество-8', '1998-01-11', 63, 1, 25),
(1840, 75, 'Фамилия-9', 'Имя-9', 'Отчество-9', '1998-01-11', 63, 1, 25),
(1841, 75, 'Фамилия-10', 'Имя-10', 'Отчество-10', '1998-01-11', 63, 1, 25),
(1842, 75, 'Фамилия-11', 'Имя-11', 'Отчество-11', '1998-01-11', 63, 1, 25),
(1843, 75, 'Фамилия-12', 'Имя-12', 'Отчество-12', '1998-01-11', 63, 1, 25),
(1844, 75, 'Фамилия-13', 'Имя-13', 'Отчество-13', '1998-01-11', 63, 1, 25),
(1845, 75, 'Фамилия-14', 'Имя-14', 'Отчество-14', '1998-01-11', 63, 1, 25),
(1846, 75, 'Фамилия-15', 'Имя-15', 'Отчество-15', '1998-01-11', 63, 1, 25),
(1847, 75, 'Фамилия-16', 'Имя-16', 'Отчество-16', '1998-01-11', 64, 1, 50),
(1848, 75, 'Фамилия-17', 'Имя-17', 'Отчество-17', '1998-01-11', 64, 1, 50),
(1849, 75, 'Фамилия-18', 'Имя-18', 'Отчество-18', '1998-01-11', 64, 1, 50),
(1850, 75, 'Фамилия-19', 'Имя-19', 'Отчество-19', '1998-01-11', 64, 1, 50),
(1851, 75, 'Фамилия-20', 'Имя-20', 'Отчество-20', '1998-01-11', 64, 1, 50),
(1852, 75, 'Фамилия-21', 'Имя-21', 'Отчество-21', '1998-01-11', 64, 1, 50),
(1853, 75, 'Фамилия-22', 'Имя-22', 'Отчество-22', '1998-01-11', 64, 1, 50),
(1854, 75, 'Фамилия-23', 'Имя-23', 'Отчество-23', '1998-01-11', 64, 1, 50),
(1855, 75, 'Фамилия-24', 'Имя-24', 'Отчество-24', '1998-01-11', 64, 1, 50),
(1856, 75, 'Фамилия-25', 'Имя-25', 'Отчество-25', '1998-01-11', 64, 1, 50),
(1857, 75, 'Фамилия-26', 'Имя-26', 'Отчество-26', '1998-01-11', 64, 1, 50),
(1858, 76, 'Фамилия-27', 'Имя-27', 'Отчество-27', '1998-01-11', 61, 0, 1500),
(1859, 76, 'Фамилия-28', 'Имя-28', 'Отчество-28', '1998-01-11', 62, 0, 1200),
(1860, 76, 'Фамилия-29', 'Имя-29', 'Отчество-29', '1998-01-11', 63, 1, 25),
(1861, 76, 'Фамилия-30', 'Имя-30', 'Отчество-30', '1998-01-11', 63, 1, 25),
(1862, 76, 'Фамилия-31', 'Имя-31', 'Отчество-31', '1998-01-11', 63, 1, 25),
(1863, 76, 'Фамилия-32', 'Имя-32', 'Отчество-32', '1998-01-11', 63, 1, 25),
(1864, 76, 'Фамилия-33', 'Имя-33', 'Отчество-33', '1998-01-11', 63, 1, 25),
(1865, 76, 'Фамилия-34', 'Имя-34', 'Отчество-34', '1998-01-11', 63, 1, 25),
(1866, 76, 'Фамилия-35', 'Имя-35', 'Отчество-35', '1998-01-11', 63, 1, 25),
(1867, 76, 'Фамилия-36', 'Имя-36', 'Отчество-36', '1998-01-11', 63, 1, 25),
(1868, 76, 'Фамилия-37', 'Имя-37', 'Отчество-37', '1998-01-11', 63, 1, 25),
(1869, 76, 'Фамилия-38', 'Имя-38', 'Отчество-38', '1998-01-11', 63, 1, 25),
(1870, 76, 'Фамилия-39', 'Имя-39', 'Отчество-39', '1998-01-11', 63, 1, 25),
(1871, 76, 'Фамилия-40', 'Имя-40', 'Отчество-40', '1998-01-11', 63, 1, 25),
(1872, 76, 'Фамилия-41', 'Имя-41', 'Отчество-41', '1998-01-11', 63, 1, 25),
(1873, 76, 'Фамилия-42', 'Имя-42', 'Отчество-42', '1998-01-11', 64, 1, 50),
(1874, 76, 'Фамилия-43', 'Имя-43', 'Отчество-43', '1998-01-11', 64, 1, 50),
(1875, 76, 'Фамилия-44', 'Имя-44', 'Отчество-44', '1998-01-11', 64, 1, 50),
(1876, 76, 'Фамилия-45', 'Имя-45', 'Отчество-45', '1998-01-11', 64, 1, 50),
(1877, 76, 'Фамилия-46', 'Имя-46', 'Отчество-46', '1998-01-11', 64, 1, 50),
(1878, 76, 'Фамилия-47', 'Имя-47', 'Отчество-47', '1998-01-11', 64, 1, 50),
(1879, 76, 'Фамилия-48', 'Имя-48', 'Отчество-48', '1998-01-11', 64, 1, 50),
(1880, 76, 'Фамилия-49', 'Имя-49', 'Отчество-49', '1998-01-11', 64, 1, 50),
(1881, 76, 'Фамилия-50', 'Имя-50', 'Отчество-50', '1998-01-11', 64, 1, 50),
(1882, 76, 'Фамилия-51', 'Имя-51', 'Отчество-51', '1998-01-11', 64, 1, 50),
(1883, 76, 'Фамилия-52', 'Имя-52', 'Отчество-52', '1998-01-11', 64, 1, 50),
(1884, 77, 'Фамилия-53', 'Имя-53', 'Отчество-53', '1998-01-11', 61, 0, 1500),
(1885, 77, 'Фамилия-54', 'Имя-54', 'Отчество-54', '1998-01-11', 62, 0, 1200),
(1886, 77, 'Фамилия-55', 'Имя-55', 'Отчество-55', '1998-01-11', 63, 1, 25),
(1887, 77, 'Фамилия-56', 'Имя-56', 'Отчество-56', '1998-01-11', 63, 1, 25),
(1888, 77, 'Фамилия-57', 'Имя-57', 'Отчество-57', '1998-01-11', 63, 1, 25),
(1889, 77, 'Фамилия-58', 'Имя-58', 'Отчество-58', '1998-01-11', 63, 1, 25),
(1890, 77, 'Фамилия-59', 'Имя-59', 'Отчество-59', '1998-01-11', 63, 1, 25),
(1891, 77, 'Фамилия-60', 'Имя-60', 'Отчество-60', '1998-01-11', 63, 1, 25),
(1892, 77, 'Фамилия-61', 'Имя-61', 'Отчество-61', '1998-01-11', 63, 1, 25),
(1893, 77, 'Фамилия-62', 'Имя-62', 'Отчество-62', '1998-01-11', 63, 1, 25),
(1894, 77, 'Фамилия-63', 'Имя-63', 'Отчество-63', '1998-01-11', 63, 1, 25),
(1895, 77, 'Фамилия-64', 'Имя-64', 'Отчество-64', '1998-01-11', 63, 1, 25),
(1896, 77, 'Фамилия-65', 'Имя-65', 'Отчество-65', '1998-01-11', 63, 1, 25),
(1897, 77, 'Фамилия-66', 'Имя-66', 'Отчество-66', '1998-01-11', 63, 1, 25),
(1898, 77, 'Фамилия-67', 'Имя-67', 'Отчество-67', '1998-01-11', 63, 1, 25),
(1899, 77, 'Фамилия-68', 'Имя-68', 'Отчество-68', '1998-01-11', 64, 1, 50),
(1900, 77, 'Фамилия-69', 'Имя-69', 'Отчество-69', '1998-01-11', 64, 1, 50),
(1901, 77, 'Фамилия-70', 'Имя-70', 'Отчество-70', '1998-01-11', 64, 1, 50),
(1902, 77, 'Фамилия-71', 'Имя-71', 'Отчество-71', '1998-01-11', 64, 1, 50),
(1903, 77, 'Фамилия-72', 'Имя-72', 'Отчество-72', '1998-01-11', 64, 1, 50),
(1904, 77, 'Фамилия-73', 'Имя-73', 'Отчество-73', '1998-01-11', 64, 1, 50),
(1905, 77, 'Фамилия-74', 'Имя-74', 'Отчество-74', '1998-01-11', 64, 1, 50),
(1906, 77, 'Фамилия-75', 'Имя-75', 'Отчество-75', '1998-01-11', 64, 1, 50),
(1907, 77, 'Фамилия-76', 'Имя-76', 'Отчество-76', '1998-01-11', 64, 1, 50),
(1908, 77, 'Фамилия-77', 'Имя-77', 'Отчество-77', '1998-01-11', 64, 1, 50),
(1909, 77, 'Фамилия-78', 'Имя-78', 'Отчество-78', '1998-01-11', 64, 1, 50),
(1910, 78, 'Фамилия-79', 'Имя-79', 'Отчество-79', '1998-01-11', 61, 0, 1500),
(1911, 78, 'Фамилия-80', 'Имя-80', 'Отчество-80', '1998-01-11', 62, 0, 1200),
(1912, 78, 'Фамилия-81', 'Имя-81', 'Отчество-81', '1998-01-11', 63, 1, 25),
(1913, 78, 'Фамилия-82', 'Имя-82', 'Отчество-82', '1998-01-11', 63, 1, 25),
(1914, 78, 'Фамилия-83', 'Имя-83', 'Отчество-83', '1998-01-11', 63, 1, 25),
(1915, 78, 'Фамилия-84', 'Имя-84', 'Отчество-84', '1998-01-11', 63, 1, 25),
(1916, 78, 'Фамилия-85', 'Имя-85', 'Отчество-85', '1998-01-11', 63, 1, 25),
(1917, 78, 'Фамилия-86', 'Имя-86', 'Отчество-86', '1998-01-11', 63, 1, 25),
(1918, 78, 'Фамилия-87', 'Имя-87', 'Отчество-87', '1998-01-11', 63, 1, 25),
(1919, 78, 'Фамилия-88', 'Имя-88', 'Отчество-88', '1998-01-11', 63, 1, 25),
(1920, 78, 'Фамилия-89', 'Имя-89', 'Отчество-89', '1998-01-11', 63, 1, 25),
(1921, 78, 'Фамилия-90', 'Имя-90', 'Отчество-90', '1998-01-11', 63, 1, 25),
(1922, 78, 'Фамилия-91', 'Имя-91', 'Отчество-91', '1998-01-11', 63, 1, 25),
(1923, 78, 'Фамилия-92', 'Имя-92', 'Отчество-92', '1998-01-11', 63, 1, 25),
(1924, 78, 'Фамилия-93', 'Имя-93', 'Отчество-93', '1998-01-11', 63, 1, 25),
(1925, 78, 'Фамилия-94', 'Имя-94', 'Отчество-94', '1998-01-11', 64, 1, 50),
(1926, 78, 'Фамилия-95', 'Имя-95', 'Отчество-95', '1998-01-11', 64, 1, 50),
(1927, 78, 'Фамилия-96', 'Имя-96', 'Отчество-96', '1998-01-11', 64, 1, 50),
(1928, 78, 'Фамилия-97', 'Имя-97', 'Отчество-97', '1998-01-11', 64, 1, 50),
(1929, 78, 'Фамилия-98', 'Имя-98', 'Отчество-98', '1998-01-11', 64, 1, 50),
(1930, 78, 'Фамилия-99', 'Имя-99', 'Отчество-99', '1998-01-11', 64, 1, 50),
(1931, 78, 'Фамилия-100', 'Имя-100', 'Отчество-100', '1998-01-11', 64, 1, 50),
(1932, 78, 'Фамилия-101', 'Имя-101', 'Отчество-101', '1998-01-11', 64, 1, 50),
(1933, 78, 'Фамилия-102', 'Имя-102', 'Отчество-102', '1998-01-11', 64, 1, 50),
(1934, 78, 'Фамилия-103', 'Имя-103', 'Отчество-103', '1998-01-11', 64, 1, 50),
(1935, 78, 'Фамилия-104', 'Имя-104', 'Отчество-104', '1998-01-11', 64, 1, 50),
(1936, 79, 'Фамилия-105', 'Имя-105', 'Отчество-105', '1998-01-11', 61, 0, 1500),
(1937, 79, 'Фамилия-106', 'Имя-106', 'Отчество-106', '1998-01-11', 62, 0, 1200),
(1938, 79, 'Фамилия-107', 'Имя-107', 'Отчество-107', '1998-01-11', 63, 1, 25),
(1939, 79, 'Фамилия-108', 'Имя-108', 'Отчество-108', '1998-01-11', 63, 1, 25),
(1940, 79, 'Фамилия-109', 'Имя-109', 'Отчество-109', '1998-01-11', 63, 1, 25),
(1941, 79, 'Фамилия-110', 'Имя-110', 'Отчество-110', '1998-01-11', 63, 1, 25),
(1942, 79, 'Фамилия-111', 'Имя-111', 'Отчество-111', '1998-01-11', 63, 1, 25),
(1943, 79, 'Фамилия-112', 'Имя-112', 'Отчество-112', '1998-01-11', 63, 1, 25),
(1944, 79, 'Фамилия-113', 'Имя-113', 'Отчество-113', '1998-01-11', 63, 1, 25),
(1945, 79, 'Фамилия-114', 'Имя-114', 'Отчество-114', '1998-01-11', 63, 1, 25),
(1946, 79, 'Фамилия-115', 'Имя-115', 'Отчество-115', '1998-01-11', 63, 1, 25),
(1947, 79, 'Фамилия-116', 'Имя-116', 'Отчество-116', '1998-01-11', 63, 1, 25),
(1948, 79, 'Фамилия-117', 'Имя-117', 'Отчество-117', '1998-01-11', 63, 1, 25),
(1949, 79, 'Фамилия-118', 'Имя-118', 'Отчество-118', '1998-01-11', 63, 1, 25),
(1950, 79, 'Фамилия-119', 'Имя-119', 'Отчество-119', '1998-01-11', 63, 1, 25),
(1951, 79, 'Фамилия-120', 'Имя-120', 'Отчество-120', '1998-01-11', 64, 1, 50),
(1952, 79, 'Фамилия-121', 'Имя-121', 'Отчество-121', '1998-01-11', 64, 1, 50),
(1953, 79, 'Фамилия-122', 'Имя-122', 'Отчество-122', '1998-01-11', 64, 1, 50),
(1954, 79, 'Фамилия-123', 'Имя-123', 'Отчество-123', '1998-01-11', 64, 1, 50),
(1955, 79, 'Фамилия-124', 'Имя-124', 'Отчество-124', '1998-01-11', 64, 1, 50),
(1956, 79, 'Фамилия-125', 'Имя-125', 'Отчество-125', '1998-01-11', 64, 1, 50),
(1957, 79, 'Фамилия-126', 'Имя-126', 'Отчество-126', '1998-01-11', 64, 1, 50),
(1958, 79, 'Фамилия-127', 'Имя-127', 'Отчество-127', '1998-01-11', 64, 1, 50),
(1959, 79, 'Фамилия-128', 'Имя-128', 'Отчество-128', '1998-01-11', 64, 1, 50),
(1960, 79, 'Фамилия-129', 'Имя-129', 'Отчество-129', '1998-01-11', 64, 1, 50),
(1961, 79, 'Фамилия-130', 'Имя-130', 'Отчество-130', '1998-01-11', 64, 1, 50);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `employees`
--
ALTER TABLE `employees`
  ADD PRIMARY KEY (`id_employee`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `employees`
--
ALTER TABLE `employees`
  MODIFY `id_employee` int(11) NOT NULL AUTO_INCREMENT COMMENT 'Идентификатор', AUTO_INCREMENT=1962;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
